# Command Line Binaries
brew "bash"
brew "bat"
brew "cmake"
brew "fontforge"
brew "gh"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "grc"
brew "jq"
brew "pypy3"
brew "python"
brew "pipx"
brew "starship"
brew "trash"
brew "virtualenv"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# AI Helpers
brew "gemini-cli"
cask "claude"
cask "claude-code"
cask "codex"

# Applications
cask "1password"
cask "1password-cli"
cask "affinity"
cask "alfred"
cask "battle-net"
cask "contexts"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "kaleidoscope"
cask "league-of-legends"
cask "little-snitch"
cask "logi-options+"
cask "mimestream"
cask "monitorcontrol"
cask "moom"
cask "postico"
cask "rocket"
cask "steam"
cask "sublime-text"
cask "tableplus"
cask "tower"
cask "unifi-identity-endpoint"
cask "visual-studio-code"
cask "vlc"
cask "wifiman"
cask "zoom"

# Fonts
cask "font-fira-code"
cask "font-fira-sans"
cask "font-cascadia-code"
cask "font-cascadia-code-nf"
cask "font-cascadia-code-pl"
